tap "github/gh"
tap "gromgit/fuse"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Calculator REPL, similar to bc(1)
brew "eva"
# Easiest way to build and release mobile apps
brew "fastlane"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Diff images from the command-line
brew "spaceman-diff"
# Sparklines for the shell
brew "spark"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"
# Application launcher and productivity software
cask "alfred", args: { appdir: "~/Applications" }
# Enable Windows-like alt-tab
cask "alt-tab"
cask "font-meslo-lg-nerd-font"
# Xcode extension for GitHub Copilot
cask "github-copilot-for-xcode"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# File system integration
cask "macfuse"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Canva", id: 897446215
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "한컴오피스 하", id: 416746898
vscode "github.copilot"
vscode "github.copilot-chat"
